Autodesk.Revit.DB.Lighting.InitialFluxIntensity.Flux
The flux intensity value.
The flux value in lm as a numerical value between 0 and 1e+30.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The flux intensity value is not valid because it is not between 0 and 1e+30.
Since:
2013

Autodesk.Revit.DB.Lighting.InitialFluxIntensity.#ctor(Autodesk.Revit.DB.Lighting.InitialFluxIntensity)
Creates a copy of the given initial flux intensity object
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Lighting.InitialFluxIntensity.#ctor(System.Double)
Creates an initial flux intensity object with the given document and flux values.
flux:
The flux value in lm as a numerical value between 0 and 1e+30.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The flux intensity value is not valid because it is not between 0 and 1e+30.
Since:
2013

Autodesk.Revit.DB.Lighting.InitialFluxIntensity
This class encapsulates initial flux intensity calculation.
Since:
2013